old_versions/k_omega_compressible_01_omega8803/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          293;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    Inlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 294.3179904975124;
    }

    Cyli
    {
        type            zeroGradient;
    }

    Botwall
    {
        type            zeroGradient;
    }

    Side1
    {
        type            empty;
    }

    Side2
    {
        type            empty;
    }
    
    Outlet
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
